xiangmu/controllers/IndexController.php

SELECT COUNT(*) FROM `we_account`
SELECT * FROM `we_account` LIMIT 5
---
    public function actionIndex_2(){
        header('content-type:text/html;charset=utf-8');
        $request = Yii::$app->request;//用于判断对否有post值传进来
        $sum   = Account::find()->asArray()->count(); //查询总条数  echo $titles;die;

        $strip = 5;                                  //设置每页展示条数
        $pages = ceil($sum/$strip);                 //计算总页数    echo $pages;
            if($request->get('page')){
                $page = $request->get('page');
               // echo $page;
            }else {
                $page = 1;//获取当前页
            }
        $offset = ($page-1)*$strip;//计算偏移量
        $up     = $page<=1?1:$page-1;//上一页
        $down   = $page>=$pages?$pages:$page+1; //下一页
        $data   = Account::find()->offset($offset)->limit($strip)->asArray()->all(); //查询总条数  echo $titles;die;

SELECT * FROM `we_account` WHERE `wx_id` IS NULL
---
    public function actionIndex_3(){
        $request = Yii::$app->request;//用于判断对否有post值传进来
        $id = $request->post('id');
        $dat =  Account::find()->where(['wx_id'=>$id])->asArray()->one();