xiangmu/controllers/LoginController.php

SELECT * FROM `we_user` WHERE (`u_name`='admin') AND (`u_pwd`='21232f297a57a5a743894a0e4a801fc3')
---
    public function actionLogin(){
        $request = Yii::$app->request;
        //判断是否存在session

        if($request->isPost){//接收登录信息
            $username = $request->post('username');
            $pwd      = md5($request->post('pwd')) ;
            $titles   =  User::find()->asArray()->where(['u_name'=>$username,'u_pwd'=>$pwd])->one() ;